MolnarRol/STM32G4_PowerConverterLearningBoardFirmware/UI/src/ui/actions.c
#include "ui.h"
#include "actions.h"
#include "screens.h"
#include <stm32g4xx.h>
#include <lvgl.h>
#include <app_types.h>
#include <PCC_public_interface.h>
#include "pcc_menu.h"
#include "PCC_private_interface.h"
#include "general_config.h"
#include "vars.h"
#include "stdio.h"
#include "main.h"

extern lv_indev_t *     input_encoder_ps;
extern lv_indev_t *     input_push_btn_ps;

extern float*           pcc_param_duty_cycle_pf32;
extern float*           pcc_param_sw_freq_pf32;
extern float*           pcc_param_deadtime_pf32;
extern float*           pcc_param_phase_shift_pf32;
extern float*           pcc_param_mod_freq_pf32;
extern float*           pcc_param_amplitude_pf32;
extern float*           pcc_param_firing_angle_pf32;
extern float*           pcc_param_pulse_len_pf32;

void start_topology_callback(lv_event_t *e);
void stop_topology_callback(lv_event_t *e);

static void remove_all_indev_events(lv_indev_t * indev_p) {
    for(u32 event_count_u32 = lv_indev_get_event_count(input_push_btn_ps); event_count_u32 > 0; event_count_u32--)
    {
        lv_indev_remove_event(indev_p, event_count_u32 - 1);
    }
}

/***************************************************************************************************************
 *  Topology screens callbacks.
 ***************************************************************************************************************/
void action_topology_screen_loaded(lv_event_t *e) {
    printf("%s\n", __func__);


    remove_all_indev_events(input_push_btn_ps);
    lv_indev_add_event_cb(input_push_btn_ps, action_go_to_power_topology_menu, LV_EVENT_PRESSED, NULL);
    lv_indev_add_event_cb(input_push_btn_ps, start_topology_callback, LV_EVENT_LONG_PRESSED, NULL);

    lv_label_set_text(objects.topo_state_label, "READY");
    lv_obj_set_style_text_color(objects.topo_state_label, (lv_color_t){.green = 255}, LV_PART_MAIN);

    set_var_pcc_param_duty_edit_en(true);
    set_var_pcc_param_sw_freq_edit_en(true);
    set_var_pcc_param_phase_shift_edit_en(true);
    set_var_pcc_param_amplitude_edit_en(true);
    set_var_pcc_param_mod_freq_edit_en(true);
    set_var_pcc_param_firing_angle_edit_en(true);
    set_var_pcc_param_pulse_len_edit_en(true);
    PCC_InitializeActiveTopology_b();
    lv_indev_set_group(input_encoder_ps, groups.param_selector);

    switch(PCC_GetActiveTopologyParameters_ps()->type_e)
        {
            case PCC_ParamType_PWM_e:
            case PCC_ParamType_ComplementaryPWM_e:
            case PCC_ParamType_PhaseShiftedPWM_e:
            case PCC_ParamType_SinePWM_e:
                lv_group_focus_obj(objects.ctrl_param__sw_freq_edit_en_btn);
                break;

            case PCC_ParamType_LineCommutated_e:
                lv_group_focus_obj(objects.ctrl_param__firing_angle_edit_en_btn);
                break;

            default:
                break;
        }
}

void action_topology_screen_unloaded(lv_event_t *e) {
    printf("%s\n", __func__);
    lv_group_set_editing(groups.param_selector, false);
    PCC_DeinitializeActiveTopology_v();
}

void start_topology_callback(lv_event_t *e) {
    char tmp_str[100];
    PCC_Params_struct* params_ps = PCC_GetActiveTopologyParameters_ps();
    lv_label_set_text(objects.topo_state_label, "RUNNING");
    lv_obj_set_style_text_color(objects.topo_state_label, (lv_color_t){.red = 255}, LV_PART_MAIN);

    remove_all_indev_events(input_push_btn_ps);
    lv_indev_add_event_cb(input_push_btn_ps, stop_topology_callback, LV_EVENT_PRESSED, NULL);

    switch(params_ps->type_e)
    {
        case PCC_ParamType_PWM_e:
            if(!get_var_pcc_param_duty_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__duty_cycle_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_duty_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Duty cycle: %.2f %%", params_ps->PWM_struct.duty_cycle__per_cent__s.val_f32);
                lv_label_set_text(objects.pcc_param__duty_cycle_edit_disabled_val_label, tmp_str);
            }

            if(!get_var_pcc_param_sw_freq_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__sw_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Switching frequency: %.2f Hz", params_ps->PWM_struct.frequency__Hz__s.val_f32);
                lv_label_set_text(objects.pcc_param__sw_freq_edit_disabled_val_label, tmp_str);
            }


            lv_obj_add_flag(objects.ctrl_param__sw_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param_1__duty_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            break;

        case PCC_ParamType_ComplementaryPWM_e:
            if(!get_var_pcc_param_duty_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__duty_cycle_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_duty_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Duty cycle: %.2f %%", params_ps->ComplementaryPWM_struct.duty_cycle__per_cent__s.val_f32);
                lv_label_set_text(objects.pcc_param__duty_cycle_edit_disabled_val_label, tmp_str);
            }

            if(!get_var_pcc_param_sw_freq_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__sw_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Switching frequency: %.2f Hz", params_ps->ComplementaryPWM_struct.frequency__Hz__s.val_f32);
                lv_label_set_text(objects.pcc_param__sw_freq_edit_disabled_val_label, tmp_str);
            }

            lv_obj_add_flag(objects.ctrl_param__sw_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param_1__duty_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param_deadtime_cnt, LV_OBJ_FLAG_HIDDEN);
            snprintf(tmp_str, sizeof(tmp_str), "Deadtime: %d ns", get_var_pcc_param_deadtime_i32());
            lv_label_set_text(objects.pcc_param__deadtime_edit_disabled_val_label, tmp_str);
            lv_obj_clear_flag(objects.pcc_param__deadtime_edit_disabled_val_label, LV_OBJ_FLAG_HIDDEN);
            break;

