MolnarRol/STM32G4_PowerConverterLearningBoardFirmware/UI/src/ui/actions.c
        case PCC_ParamType_PhaseShiftedPWM_e:
            if(!get_var_pcc_param_phase_shift_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__phase_shift_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_phase_shift_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Phase shift: %.2f degree", params_ps->PhaseShiftedPWM_struct.phase_shift__deg__s.val_f32);
                lv_label_set_text(objects.pcc_param__phase_shift_edit_disabled_val_label, tmp_str);
            }

            if(!get_var_pcc_param_sw_freq_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__sw_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Switching frequency: %.2f Hz", params_ps->PhaseShiftedPWM_struct.frequency__Hz__s.val_f32);
                lv_label_set_text(objects.pcc_param__sw_freq_edit_disabled_val_label, tmp_str);
            }

            lv_obj_add_flag(objects.ctrl_param__sw_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param__phase_shift_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param_deadtime_cnt, LV_OBJ_FLAG_HIDDEN);
            snprintf(tmp_str, sizeof(tmp_str), "Deadtime: %d ns", get_var_pcc_param_deadtime_i32());
            lv_label_set_text(objects.pcc_param__deadtime_edit_disabled_val_label, tmp_str);
            lv_obj_clear_flag(objects.pcc_param__deadtime_edit_disabled_val_label, LV_OBJ_FLAG_HIDDEN);
            break;

        case PCC_ParamType_SinePWM_e:
            if(!get_var_pcc_param_sw_freq_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__sw_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Switching frequency: %.2f Hz", params_ps->SinePWM_struct.switching_frequency__Hz__s.val_f32);
                lv_label_set_text(objects.pcc_param__sw_freq_edit_disabled_val_label, tmp_str);
            }

            if(!get_var_pcc_param_mod_freq_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__mod_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_mod_freq_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Modulating frequency: %.2f Hz", params_ps->SinePWM_struct.modulation_frequency__Hz__s.val_f32);
                lv_label_set_text(objects.pcc_param__mod_freq_edit_disabled_val_label, tmp_str);
            }

            if(!get_var_pcc_param_amplitude_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__amplitude_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_amplitude_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Amplitude: %.2f %%", params_ps->SinePWM_struct.amplitude__per_cent__s.val_f32);
                lv_label_set_text(objects.pcc_param__amplitude_edit_disabled_val_label, tmp_str);
            }

            lv_obj_add_flag(objects.ctrl_param__sw_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param__mod_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param__amplitude_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param_deadtime_cnt, LV_OBJ_FLAG_HIDDEN);
            snprintf(tmp_str, sizeof(tmp_str), "Deadtime: %d ns", get_var_pcc_param_deadtime_i32());
            lv_label_set_text(objects.pcc_param__deadtime_edit_disabled_val_label, tmp_str);
            lv_obj_clear_flag(objects.pcc_param__deadtime_edit_disabled_val_label, LV_OBJ_FLAG_HIDDEN);
            break;

        case PCC_ParamType_LineCommutated_e:
            printf("%s\n", __func__);
            if(!get_var_pcc_param_firing_angle_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__firing_angle_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_firing_angle_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Firing angle: %.2f degree", params_ps->LineCommutation_struct.firing_angle__deg__s.val_f32);
                lv_label_set_text(objects.pcc_param__firing_angle_edit_disabled_val_label, tmp_str);
            }

            if(!get_var_pcc_param_pulse_len_edit_en()) {
                lv_obj_clear_flag(objects.pcc_param__pulse_len_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(objects.ctrl_param_pulse_len_cnt, LV_OBJ_FLAG_HIDDEN);
                snprintf(tmp_str, sizeof(tmp_str), "Gate pulse length: %.2f degree", params_ps->LineCommutation_struct.pulse_len__deg__s.val_f32);
                lv_label_set_text(objects.pcc_param__pulse_len_edit_disabled_val_label, tmp_str);
            }

            lv_obj_add_flag(objects.ctrl_param__firing_angle_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param__pulse_len_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_line_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            break;

        default:
            break;
    }
    PCC_StartActiveTopology_v();
}

void stop_topology_callback(lv_event_t *e) {
    PCC_StopActiveTopology_v();
    lv_indev_wait_release(input_push_btn_ps);
    lv_label_set_text(objects.topo_state_label, "READY");
    lv_obj_set_style_text_color(objects.topo_state_label, (lv_color_t){.green = 255}, LV_PART_MAIN);
    remove_all_indev_events(input_push_btn_ps);
    lv_indev_add_event_cb(input_push_btn_ps, action_go_to_power_topology_menu, LV_EVENT_PRESSED, NULL);
    lv_indev_add_event_cb(input_push_btn_ps, start_topology_callback, LV_EVENT_LONG_PRESSED, NULL);

    switch(PCC_GetActiveTopologyParameters_ps()->type_e)
    {
        case PCC_ParamType_PWM_e:
            lv_obj_clear_flag(objects.ctrl_param__sw_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_1__duty_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_duty_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__duty_cycle_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__sw_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);

            break;

        case PCC_ParamType_ComplementaryPWM_e:
            lv_obj_clear_flag(objects.ctrl_param__sw_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_1__duty_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_duty_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_deadtime_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__duty_cycle_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__sw_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__deadtime_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            break;

