MolnarRol/STM32G4_PowerConverterLearningBoardFirmware/UI/src/ui/actions.c
        case PCC_ParamType_PhaseShiftedPWM_e:
            lv_obj_clear_flag(objects.ctrl_param__sw_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param__phase_shift_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_phase_shift_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_deadtime_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__phase_shift_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__sw_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__deadtime_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            break;

        case PCC_ParamType_SinePWM_e:
            lv_obj_clear_flag(objects.ctrl_param__sw_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param__amplitude_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param__mod_freq_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_mod_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_amplitude_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_deadtime_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__sw_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__mod_freq_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__amplitude_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__deadtime_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            break;

        case PCC_ParamType_LineCommutated_e:
            printf("%s\n", __func__);
            lv_obj_clear_flag(objects.ctrl_param__firing_angle_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param__pulse_len_edit_en_btn, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_firing_angle_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_pulse_len_cnt, LV_OBJ_FLAG_HIDDEN);

            lv_obj_add_flag(objects.pcc_param__firing_angle_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.pcc_param__pulse_len_edit_disabled_val_label,LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(objects.ctrl_param_line_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            break;

        default:
            break;
    }
}

/***************************************************************************************************************
 *  Settings screen callbacks.
 ***************************************************************************************************************/
void action_settings_screen_loaded(lv_event_t *e) {
    static lv_obj_t* project_url_qr_ps = NULL;
    static const char* project_url_p = PROD_SOURCE_URL_d;

    remove_all_indev_events(input_push_btn_ps);
    lv_indev_wait_release(input_encoder_ps);
    lv_indev_wait_release(input_push_btn_ps);

    if(project_url_qr_ps == NULL) {
        project_url_qr_ps = lv_qrcode_create(objects.sw_info_container);
        lv_qrcode_set_size(project_url_qr_ps, lv_obj_get_height(objects.sw_info_container) - 300);
        lv_qrcode_update(project_url_qr_ps, project_url_p, strlen(project_url_p));
        lv_obj_align(project_url_qr_ps, LV_ALIGN_BOTTOM_RIGHT, -4, -4);
    }

    lv_label_set_text(objects.sw_version_str_label, PROD_SW_VERSION_STR_d);
    lv_label_set_text(objects.hw_revision_str_label, PROD_HW_REVISION_STR_d);

    lv_indev_set_group(input_encoder_ps, groups.settings_group);
    lv_indev_add_event_cb(input_push_btn_ps, action_back_to_main_menu, LV_EVENT_PRESSED, NULL);
}

void action_settings_screen_unloaded(lv_event_t *e) {
    lv_group_set_editing(groups.settings_group, false);
}

/***************************************************************************************************************
 *  Main screen callbacks.
 ***************************************************************************************************************/
void action_main_screen_loaded(lv_event_t *e) {
    remove_all_indev_events(input_push_btn_ps);
    lv_indev_set_group(input_encoder_ps, groups.MainGroup);
}

/***************************************************************************************************************
 *  Topology select screen.
 ***************************************************************************************************************/
void action_pcc_topology_menu_loaded(lv_event_t *e) {
    lv_indev_wait_release(input_encoder_ps);
    remove_all_indev_events(input_push_btn_ps);
    ui_init_pcc_menu_v();

    lv_indev_set_group(input_encoder_ps, groups.pcc_topology_select_grp);
    lv_indev_add_event_cb(input_push_btn_ps, action_back_to_main_menu, LV_EVENT_PRESSED, NULL);
}

void action_pcc_topology_menu_unloaded(lv_event_t *e) {
    lv_group_set_editing(groups.pcc_topology_select_grp, false);
}

void action_load_pcc_topology_ctrl_screen(lv_event_t *e) {
    char tmp_str[100];
    lv_obj_t* child_ps;
    PCC_TopologyHandle_struct* topo_handle_s = (PCC_TopologyHandle_struct*)lv_event_get_user_data(e);

    if(PCC_SetTopology_b(topo_handle_s) == False_b)
    {
        Error_Handler();
    }

    lv_label_set_text(objects.topo_name_label, topo_handle_s->ctrl_name_str);

    for(u32 child_iu32 = 0; child_iu32 < lv_obj_get_child_count(objects.ctrl_param_main_cnt); child_iu32++) {
        child_ps = lv_obj_get_child(objects.ctrl_param_main_cnt, child_iu32);
        lv_obj_add_flag(child_ps, LV_OBJ_FLAG_HIDDEN);
    }

    switch(topo_handle_s->ctrl_params_pv->type_e)
    {
        case PCC_ParamType_PWM_e:
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->PWM_struct.frequency__Hz__s.min_f32);
            lv_label_set_text(objects.ctrl_param__sw_freq_min_val_placeholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->PWM_struct.frequency__Hz__s.max_f32);
            lv_label_set_text(objects.ctrl_param__sw_freq_max_val_placeholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->PWM_struct.duty_cycle__per_cent__s.min_f32);
            lv_label_set_text(objects.ctrl_param_1__duty_min_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->PWM_struct.duty_cycle__per_cent__s.max_f32);
            lv_label_set_text(objects.ctrl_param_1__duty_max_label, tmp_str);

