MolnarRol/STM32G4_PowerConverterLearningBoardFirmware/UI/src/ui/actions.c
            lv_slider_set_range(objects.ctrl_param_1__duty_slider,
                                topo_handle_s->ctrl_params_pv->PWM_struct.duty_cycle__per_cent__s.min_f32,
                                topo_handle_s->ctrl_params_pv->PWM_struct.duty_cycle__per_cent__s.max_f32);

            lv_spinbox_set_range(objects.ctrl_param_1__duty_spinbox,
                                 topo_handle_s->ctrl_params_pv->PWM_struct.duty_cycle__per_cent__s.min_f32 * 100.0f,
                                 topo_handle_s->ctrl_params_pv->PWM_struct.duty_cycle__per_cent__s.max_f32 * 100.0f);

            lv_spinbox_set_range(objects.ctrl_param__sw_freq_spinbox,
                                topo_handle_s->ctrl_params_pv->PWM_struct.frequency__Hz__s.min_f32 * 100.0f,
                                topo_handle_s->ctrl_params_pv->PWM_struct.frequency__Hz__s.max_f32 * 100.0f);


            lv_obj_clear_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_duty_cnt, LV_OBJ_FLAG_HIDDEN);

            pcc_param_duty_cycle_pf32 = &topo_handle_s->ctrl_params_pv->PWM_struct.duty_cycle__per_cent__s.val_f32;
            pcc_param_sw_freq_pf32 = &topo_handle_s->ctrl_params_pv->PWM_struct.frequency__Hz__s.val_f32;
            break;

        case PCC_ParamType_ComplementaryPWM_e:
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.frequency__Hz__s.min_f32);
            lv_label_set_text(objects.ctrl_param__sw_freq_min_val_placeholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.frequency__Hz__s.max_f32);
            lv_label_set_text(objects.ctrl_param__sw_freq_max_val_placeholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.duty_cycle__per_cent__s.min_f32);
            lv_label_set_text(objects.ctrl_param_1__duty_min_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.duty_cycle__per_cent__s.max_f32);
            lv_label_set_text(objects.ctrl_param_1__duty_max_label, tmp_str);

            lv_slider_set_range(objects.ctrl_param_1__duty_slider,
                                topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.duty_cycle__per_cent__s.min_f32,
                                topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.duty_cycle__per_cent__s.max_f32);

            lv_spinbox_set_range(objects.ctrl_param_1__duty_spinbox,
                                 topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.duty_cycle__per_cent__s.min_f32 * 100.0f,
                                 topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.duty_cycle__per_cent__s.max_f32 * 100.0f);

            lv_spinbox_set_range(objects.ctrl_param__sw_freq_spinbox,
                                topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.frequency__Hz__s.min_f32 * 100.0f,
                                topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.frequency__Hz__s.max_f32 * 100.0f);

            lv_spinbox_set_range(objects.ctrl_param__deadtime_spinbox,
                                 0,
                                 5000);

            lv_obj_clear_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_duty_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_deadtime_cnt, LV_OBJ_FLAG_HIDDEN);

            pcc_param_duty_cycle_pf32 = &topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.duty_cycle__per_cent__s.val_f32;
            pcc_param_sw_freq_pf32 = &topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.frequency__Hz__s.val_f32;
            pcc_param_deadtime_pf32 = &topo_handle_s->ctrl_params_pv->ComplementaryPWM_struct.dead_time__s__s.val_f32;
            break;

        case PCC_ParamType_PhaseShiftedPWM_e:
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.frequency__Hz__s.min_f32);
            lv_label_set_text(objects.ctrl_param__sw_freq_min_val_placeholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.frequency__Hz__s.max_f32);
            lv_label_set_text(objects.ctrl_param__sw_freq_max_val_placeholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.phase_shift__deg__s.min_f32);
            lv_label_set_text(objects.ctrl_param__phase_shift_min_val_palceholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.phase_shift__deg__s.max_f32);
            lv_label_set_text(objects.ctrl_param__phase_shift_max_val_palceholder_label, tmp_str);

            lv_slider_set_range(objects.ctrl_param__phase_shift_slider,
                                topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.phase_shift__deg__s.min_f32,
                                topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.phase_shift__deg__s.max_f32);

            lv_spinbox_set_range(objects.ctrl_param__phase_shift_spinbox,
                                 topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.phase_shift__deg__s.min_f32 * 100.0f,
                                 topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.phase_shift__deg__s.max_f32 * 100.0f);

            lv_spinbox_set_range(objects.ctrl_param__sw_freq_spinbox,
                                topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.frequency__Hz__s.min_f32 * 100.0f,
                                topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.frequency__Hz__s.max_f32 * 100.0f);

            lv_obj_clear_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_phase_shift_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_deadtime_cnt, LV_OBJ_FLAG_HIDDEN);

            pcc_param_phase_shift_pf32 = &topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.phase_shift__deg__s.val_f32;
            pcc_param_sw_freq_pf32 = &topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.frequency__Hz__s.val_f32;
            pcc_param_deadtime_pf32 = &topo_handle_s->ctrl_params_pv->PhaseShiftedPWM_struct.dead_time__s__s.val_f32;
            break;

        case PCC_ParamType_SinePWM_e:
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->SinePWM_struct.switching_frequency__Hz__s.min_f32);
            lv_label_set_text(objects.ctrl_param__sw_freq_min_val_placeholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->SinePWM_struct.switching_frequency__Hz__s.max_f32);
            lv_label_set_text(objects.ctrl_param__sw_freq_max_val_placeholder_label, tmp_str);

            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->SinePWM_struct.modulation_frequency__Hz__s.min_f32);
            lv_label_set_text(objects.ctrl_param__mod_freq_min_val_palceholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->SinePWM_struct.modulation_frequency__Hz__s.max_f32);
            lv_label_set_text(objects.ctrl_param__mod_freq_max_val_palceholder_label, tmp_str);

