MolnarRol/STM32G4_PowerConverterLearningBoardFirmware/UI/src/ui/actions.c
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->SinePWM_struct.amplitude__per_cent__s.min_f32);
            lv_label_set_text(objects.ctrl_param__amplitude_min_val_palceholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->SinePWM_struct.amplitude__per_cent__s.max_f32);
            lv_label_set_text(objects.ctrl_param__amplitude_max_val_palceholder_label, tmp_str);

            lv_slider_set_range(objects.ctrl_param__mod_freq_slider,
                                topo_handle_s->ctrl_params_pv->SinePWM_struct.modulation_frequency__Hz__s.min_f32,
                                topo_handle_s->ctrl_params_pv->SinePWM_struct.modulation_frequency__Hz__s.max_f32);

            lv_slider_set_range(objects.ctrl_param__amplitude_slider,
                                 topo_handle_s->ctrl_params_pv->SinePWM_struct.amplitude__per_cent__s.min_f32,
                                 topo_handle_s->ctrl_params_pv->SinePWM_struct.amplitude__per_cent__s.max_f32);

            lv_spinbox_set_range(objects.ctrl_param__mod_freq_spinbox,
                                topo_handle_s->ctrl_params_pv->SinePWM_struct.modulation_frequency__Hz__s.min_f32 * 100.0f,
                                topo_handle_s->ctrl_params_pv->SinePWM_struct.modulation_frequency__Hz__s.max_f32 * 100.0f);

            lv_spinbox_set_range(objects.ctrl_param__amplitude_spinbox,
                                 topo_handle_s->ctrl_params_pv->SinePWM_struct.amplitude__per_cent__s.min_f32 * 100.0f,
                                 topo_handle_s->ctrl_params_pv->SinePWM_struct.amplitude__per_cent__s.max_f32 * 100.0f);

            lv_spinbox_set_range(objects.ctrl_param__sw_freq_spinbox,
                                topo_handle_s->ctrl_params_pv->SinePWM_struct.switching_frequency__Hz__s.min_f32 * 100.0f,
                                topo_handle_s->ctrl_params_pv->SinePWM_struct.switching_frequency__Hz__s.max_f32 * 100.0f);

            lv_obj_clear_flag(objects.ctrl_param_amplitude_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_sw_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_mod_freq_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_deadtime_cnt, LV_OBJ_FLAG_HIDDEN);

            pcc_param_amplitude_pf32    = &topo_handle_s->ctrl_params_pv->SinePWM_struct.amplitude__per_cent__s.val_f32;
            pcc_param_sw_freq_pf32      = &topo_handle_s->ctrl_params_pv->SinePWM_struct.switching_frequency__Hz__s.val_f32;
            pcc_param_mod_freq_pf32     = &topo_handle_s->ctrl_params_pv->SinePWM_struct.modulation_frequency__Hz__s.val_f32;
            pcc_param_deadtime_pf32     = &topo_handle_s->ctrl_params_pv->SinePWM_struct.dead_time__s__s.val_f32;
            break;

        case PCC_ParamType_LineCommutated_e:
            printf("%d\n", __LINE__);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->LineCommutation_struct.firing_angle__deg__s.min_f32);
            lv_label_set_text(objects.ctrl_param__firing_angle_min_val_palceholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->LineCommutation_struct.firing_angle__deg__s.max_f32);
            lv_label_set_text(objects.ctrl_param__firing_angle_max_val_palceholder_label, tmp_str);

            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->LineCommutation_struct.pulse_len__deg__s.min_f32);
            lv_label_set_text(objects.ctrl_param__pulse_len_min_val_placeholder_label, tmp_str);
            snprintf(tmp_str, sizeof(tmp_str), "%.0f", topo_handle_s->ctrl_params_pv->LineCommutation_struct.pulse_len__deg__s.max_f32);
            lv_label_set_text(objects.ctrl_param__pulse_len_max_val_placeholder_label, tmp_str);

            lv_slider_set_range(objects.ctrl_param__firing_angle_slider,
                                topo_handle_s->ctrl_params_pv->LineCommutation_struct.firing_angle__deg__s.min_f32,
                                topo_handle_s->ctrl_params_pv->LineCommutation_struct.firing_angle__deg__s.max_f32);

            lv_spinbox_set_range(objects.ctrl_param__firing_angle_spinbox,
                                 topo_handle_s->ctrl_params_pv->LineCommutation_struct.firing_angle__deg__s.min_f32 * 100.0f,
                                 topo_handle_s->ctrl_params_pv->LineCommutation_struct.firing_angle__deg__s.max_f32 * 100.0f);

            lv_spinbox_set_range(objects.ctrl_param__pulse_len_spinbox,
                                topo_handle_s->ctrl_params_pv->LineCommutation_struct.pulse_len__deg__s.min_f32,
                                topo_handle_s->ctrl_params_pv->LineCommutation_struct.pulse_len__deg__s.max_f32);

            lv_obj_clear_flag(objects.ctrl_param_firing_angle_cnt, LV_OBJ_FLAG_HIDDEN);
            lv_obj_clear_flag(objects.ctrl_param_pulse_len_cnt, LV_OBJ_FLAG_HIDDEN);

            pcc_param_firing_angle_pf32 = &topo_handle_s->ctrl_params_pv->LineCommutation_struct.firing_angle__deg__s.val_f32;
            pcc_param_pulse_len_pf32    = &topo_handle_s->ctrl_params_pv->LineCommutation_struct.pulse_len__deg__s.val_f32;
            lv_group_focus_obj(objects.ctrl_param__firing_angle_edit_en_btn);
            break;

        default:
            break;
    }

    loadScreen(SCREEN_ID_TOPO_CTRL_PARAMETER_SCR);
}

/***************************************************************************************************************
 *  Screen switch events.
 ***************************************************************************************************************/
void action_go_to_settings(lv_event_t *e) {
    loadScreen(SCREEN_ID_SETTINGS);
}

void action_go_to_power_topology_menu(lv_event_t * e) {
    loadScreen(SCREEN_ID_POWER_TOPOLOGY_MENU);
}

void action_back_to_main_menu(lv_event_t *e) {
    loadScreen(SCREEN_ID_MAIN);
}
